[
  {
    "url": "https://www.linkedin.com/in/stoidis/",
    "name": "Vasilis Stoidis",
    "important": [
      "Value-add Investor",
      "Startup Mentor",
      "Advisor",
      "4-time Founder & CEO",
      "7L International",
      "Technical University of Crete",
      "Electronics and Computer Engineering",
      "Fan of Archimedes, Heraclitus, Aristotle, Confucius, Charlie Munger"
    ],
    "all_details": "Vasilis Stoidis, based in New York, is a seasoned tech founder and CEO with over 11 years of experience at 7L International. He is a value-add investor and startup mentor, actively involved in advising emerging companies. His educational background includes a degree in Electronics and Computer Engineering from the Technical University of Crete. Vasilis has held multiple mentorship roles, including positions at XRC Labs, 76 Forward, and The Ember Company. He has a strong online presence with over 10,500 followers and is recognized for his insights on AI and business strategy. His interests include philosophy and influential thinkers, reflecting a broad intellectual curiosity. Vasilis is committed to fostering innovation and supporting startups in navigating challenges in the tech landscape."
  },
  {
    "url": "https://www.linkedin.com/in/aaravgupta/",
    "name": "Aarav Gupta",
    "important": [
      "CS & Finance",
      "Washington University in St. Louis",
      "Technology Consultant",
      "Business Development Intern",
      "Artificial Intelligence Intern",
      "Co-Founder of JoyBox",
      "IBDP 1 Subject Topper",
      "CEMC Hypatia - Distinction",
      "SAT Score: 1520"
    ],
    "all_details": "Aarav Gupta, a Computer Science and Finance major at Washington University in St. Louis, with a strong foundation in technology and business. Currently a Technology Consultant at Bear Studios, LLC, and previously held internships in Business Development and Artificial Intelligence. Co-founded JoyBox, focusing on poverty alleviation. Notable academic achievements include being an IBDP 1 Subject Topper and receiving a distinction from CEMC Hypatia. Active in projects like 1m^3 Cleaning Device aimed at water conservation. Demonstrates skills in collaborative problem solving and strategic thinking. Engaged in community outreach and educational leadership during high school as House Vice-Captain and Head Boy. Interests in machine learning and data analysis, with a GitHub showcasing projects. Strong SAT score of 1520 reflects academic excellence."
  },
  {
    "url": "https://www.linkedin.com/in/arnavsinghrana/",
    "name": "Arnav Singh Rana",
    "important": [
      "Data Enthusiast",
      "Python",
      "SQL",
      "Data Visualization",
      "Platform Engineer",
      "Wells Fargo",
      "System Operations Associate",
      "Data Science",
      "Analytics",
      "Machine Learning",
      "Google Data Analytics",
      "GeeksforGeeks"
    ],
    "all_details": "Currently a System Operations Associate at Wells Fargo, focusing on data analysis, Python (Numpy, Pandas), and SQL. Passionate about leveraging data for insights and transitioning into data science. Holds a Master's in Computer Applications from Lovely Professional University (2024-2026) and a Bachelor's in Business Administration from Hemvati Nandan Bahuguna Garhwal University (2018-2022). Completed Google Data Analytics certification and a Data Science Training Program from GeeksforGeeks. Key skills include Python, SQL, Microsoft Excel, NumPy, and Streamlit. Actively involved in projects like Retail Sales Analysis and Walmart SQL questions. Open to volunteer for causes in health, education, and environment."
  },
  {
    "url": "https://www.linkedin.com/in/ritamnandi/",
    "name": "Ritam Nandi",
    "important": [
      "Honors CS & Econ",
      "University of Illinois Urbana-Champaign",
      "OTCR Consulting",
      "4.0 GPA",
      "AIME Qualifier",
      "Gold President’s Volunteer Service Award",
      "Data flow analysis",
      "SQL",
      "Python",
      "Flask",
      "Raspberry Pi"
    ],
    "all_details": "Ritam Nandi, pursuing a Bachelor of Science in Computer Science and Economics at UIUC, expected graduation in May 2026. Currently a Consultant at OTCR Consulting since Feb 2024, with experience in Bloomberg Terminal, commodity derivatives analysis, and data analysis using NumPy and Pandas. Previous role as IT Development Intern at GE HealthCare, focusing on data flow analysis, UX improvements, and API integrations. Active in extracurriculars, including OTCR Consulting and recognized for academic excellence with a 4.0 GPA. Notable achievements include qualifying for the AIME and receiving the Gold President’s Volunteer Service Award. High school education at Mission San Jose High School, excelling in advanced mathematics and AP courses. Interests in technology, data science, and consulting."
  },
  {
    "url": "https://www.linkedin.com/in/samvit-govindani-6ba530329/",
    "name": "Samvit Govindani",
    "important": [
      "BME/Biotech Aspirant",
      "IB Diploma",
      "School Ambassador at DPSI",
      "Founder of Project ReFlex",
      "HundrED Youth Ambassador",
      "STEM Enthusiast",
      "Content Creator",
      "Advocate of Sustainable Engineering",
      "Top skills: Biology, Chemistry, Physics, Research Skills, Entrepreneurship",
      "Runner-up in IB CAS inter-school summit",
      "National Society of High School Scholars invitee"
    ],
    "all_details": "Committed 11th-grade student with a passion for biochemistry and biotechnology. Engaged in IB curriculum focusing on core sciences. Founder of Project ReFlex, promoting sustainability. Active in HundrED as a Youth Ambassador. School Ambassador at DPS International, leading Digital Human Library Project. Co-founder of MinuteMYP, a YouTube channel for IB MYP students. Strong skills in project management and entrepreneurship. Recognized for academic excellence with high scores in NMSQT and IB assessments. Interests in education, science, and environmental causes. Volunteering with Robin Hood Army to teach math to underprivileged students. Engaged in various science projects and initiatives."
  },
  {
    "url": "https://www.linkedin.com/in/tejaswasan/",
    "name": "Tejas Wasan",
    "important": [
      "Student",
      "Bal bharati public school ludhiana",
      "Prefect",
      "House captain",
      "Smart SOS Helmet",
      "MargDarshak"
    ],
    "all_details": "Tejas Wasan, student at Bal bharati public school ludhiana, involved in various leadership roles including Mercury House prefect and House captain. Engaged in innovative projects like Smart SOS Helmet, aimed at enhancing safety for two-wheeler riders. Participated in MargDarshak, developing assistive technology for visually impaired individuals. Active on LinkedIn with 123 connections, showcasing interests in technology and community service. Demonstrates skills in C programming, with a focus on practical applications in projects. Engaged in school activities, fostering leadership and teamwork."
  },
  {
    "url": "https://www.linkedin.com/in/ricky-chen-8225b5220/",
    "name": "Ricky Chen",
    "important": [
      "SWE Intern",
      "TSMC",
      "Computer Engineering",
      "University of Illinois Urbana-Champaign",
      "AI/ML",
      "Tau Beta Pi",
      "Service Event Chair",
      "Applied Machine Learning",
      "Artificial Intelligence"
    ],
    "all_details": "Senior at University of Illinois Urbana-Champaign, pursuing Bachelor of Engineering in Computer Engineering with a Minor in Business. Experience as Software Engineer Intern at TSMC, working on AI applications in chip design. Course Assistant for ECE 330, providing support to students. Background in AI/ML with hands-on experience in building scalable architectures. Involved in Tau Beta Pi, coordinating service events, and engaging in projects like Distributed File System with Streaming and Smart Doorbell with Mobile App. Proficient in Python, with interests in cryptography and machine learning. Fluent in Chinese and English."
  },
  {
    "url": "https://www.linkedin.com/in/jake-oshea/",
    "name": "Jake O'Shea",
    "important": [
      "Principal at Antler",
      "Co-Founder of AITX",
      "Director of Portfolio Operations at Foundation Capital",
      "Director of Platform at Capital Factory",
      "Lead Mentor at Longhorn Startup Lab",
      "Bachelor of Arts in Political Science and Government",
      "Bachelor of Science in Business/Corporate Communications",
      "Venture Capital",
      "Fundraising",
      "AI and Fintech",
      "500+ connections"
    ],
    "all_details": "Jake O'Shea, Principal at Antler, based in Austin, Texas. Co-Founder of AITX, a community for AI engineers and entrepreneurs. Former Director of Portfolio Operations at Foundation Capital, focusing on early-stage AI and Fintech startups. Previously served as Director of Platform at Capital Factory, supporting Texas entrepreneurs. Extensive experience in venture capital and fundraising. Educational background includes dual degrees from The University of Texas at Austin in Political Science and Business Communications. Active in mentoring through Longhorn Startup Lab and Social Entrepreneurship Learning Lab. Engaged in community-building initiatives, organizing recruiting events for Texas Delta Upsilon. Interests in AI, entrepreneurship, and economic empowerment."
  },
  {
    "url": "https://www.linkedin.com/in/ayaan-hashmi/",
    "name": "Ayaan Hashmi",
    "important": [
      "Student",
      "President - Paradigm Tech Club",
      "Vice President of Computers and Robotics - Student Council",
      "Roller Speed Skater",
      "New Delhi, Delhi, India",
      "Leadership",
      "Team Management",
      "Programming",
      "Computer Science (CS)",
      "Artificial Intelligence (AI)",
      "Selected for Vigyantram National Innovation Championship @ IIT - Delhi"
    ],
    "all_details": "Class XI student at Mayoor School, Noida. Strong interest in software development and technology. President of PARADIGM, leading teams and organizing events. Participated in numerous hackathons, ranked among top finalists globally. Experience in leadership roles, teamwork, problem-solving. Skills in programming, computer science, and AI. Volunteered for CodeDay Delhi NCR. Achievements include high scores in Class X AI (97%) and Board Exams (91%). Engaged in extracurricular activities, including roller skating. Fluent in English and Hindi. Active in school organizations and tech initiatives."
  },
  {
    "url": "https://www.linkedin.com/in/shriya-verma-384a1732b/",
    "name": "Shriya Verma",
    "important": [
      "Founder and President of Canvas for Impact",
      "Graphic Designer",
      "Artist",
      "E-Summit'25",
      "Veer Gatha Super 100",
      "Public Speaking",
      "Graphic Designing",
      "UI/UX",
      "Social Media Management"
    ],
    "all_details": "Currently in 11th grade at Greater Noida World School, pursuing PCM. Founder of Canvas for Impact, focusing on graphic design and social media. Internships at Humanitech, Zap, and Women United. Achievements include Certificate of Participation in E-Summit'25 and recognition in Veer Gatha Super 100 project. Skills in graphic arts, public speaking, and social media management. Interests in drawing, graphic design, and learning new skills. Actively seeking opportunities in graphic design roles. Engaged in various activities like basketball and coding. Proficient in English and Hindi."
  },
  {
    "url": "https://www.linkedin.com/in/yutong-zoe-chen-4b3796281/",
    "name": "Yutong (Zoe) Chen",
    "important": [
      "Computer Science",
      "Economics",
      "University of Illinois Urbana-Champaign",
      "Software Engineer Intern",
      "China Resources",
      "Large Language Models",
      "Python",
      "C++",
      "Course Assistant"
    ],
    "all_details": "Junior at University of Illinois Urbana-Champaign, majoring in Computer Science and Economics. Interned at China Resources Digital, optimizing AI workflows and enhancing business efficiency. Experience in large-scale system design and AI integration. Currently a Course Assistant for CS411 (Database Systems). Skills include Python, C++, and Large Language Models (LLM). Actively seeking Software Engineer, Data Scientist, and IT Analyst roles. Engaged in projects that improve extraction accuracy using multimodal processing. Strong academic background with a high school diploma from Shenzhen Foreign Languages School."
  },
  {
    "url": "https://www.linkedin.com/in/sehgal5/",
    "name": "Sara Sehgal",
    "important": [
      "Electrical Engineering",
      "UIUC",
      "James Scholar",
      "Research Scientist - AI@UIUC",
      "Consultant at Illinois Business Consulting",
      "Facilities Engineering Intern at Alcon",
      "Technical Workshop Chair",
      "Applied Machine Learning",
      "Python",
      "Leadership",
      "Power Supplies",
      "Analog Semiconductors"
    ],
    "all_details": "Electrical Engineering student at UIUC, passionate about technology and problem-solving. Experience as a Research Scientist at Lapis Labs focusing on air pollution models using machine learning. Consultant at Illinois Business Consulting, working on climate risk management solutions. Previous Facilities Engineering Intern at Alcon, improving manufacturing efficiency. Technical Workshop Chair for Women in Electrical and Computer Engineering at UIUC. Strong skills in Python, applied machine learning, and leadership. Education includes courses in Analog Signal Processing and Computer Systems. Holds certifications in Internet of Things from Stanford. Notable projects include Sustainable Multipurpose Shadow Panel. Recognized for academic excellence and global citizenship awards."
  },
  {
    "url": "https://www.linkedin.com/in/viral-suchak-1703/",
    "name": "Viral Suchak",
    "important": [
      "Graduate Student",
      "Northeastern University",
      "MS in Information Systems",
      "Ex-PwC",
      "Deloitte",
      "Mastek (Evosys)",
      "Senior Associate",
      "Oracle Payroll Cloud 2023 Certified Implementation Professional",
      "Proactive problem-solver",
      "Intern Android Developer"
    ],
    "all_details": "Graduate student at Northeastern University pursuing MS in Information Systems. Previous experience includes roles at PwC as Senior Associate, and Deloitte as Consultant. Worked on Oracle Fusion Cloud implementations for SMSA Express Transportation Company and Wataniya Insurance Company. Holds a Bachelor's degree in Computer Science and Engineering from Amravati University. Skills include Oracle Payroll Cloud, problem-solving, and project management. Actively seeking opportunities to bridge complex ideas with robust solutions. Interests in IBM and Oracle. Fluent in English and Gujarati."
  },
  {
    "url": "https://www.linkedin.com/in/adit29/",
    "name": "Adit Agarwal",
    "important": [
      "Incoming SWE Intern",
      "Meta",
      "University of Illinois Urbana-Champaign",
      "C++",
      "Cloud Computing",
      "AI/ML Engineering Intern",
      "Software Engineer Intern",
      "Project Intern",
      "Student Intern",
      "Vice President, HFS",
      "Model UN Delegate"
    ],
    "all_details": "Adit Agarwal, Computer Science student at UIUC, incoming Software Engineer Intern at Meta NYC. Previous experience includes AI/ML Engineering Intern at Droisys, Software Engineer Intern at asymtos, Project Intern at Gulf Oil, and Student Intern at Oorjan Cleantech. Active in extracurriculars, served as Vice President of HFS, and engaged in Model UN. Developed Covid Vaccine Bot project, achieving 1.5M impressions. Skills in C++, Cloud Computing, and software development. Education includes Bachelor's and Master's in Computer Science, with a strong academic record. Interests in technology and social impact, fluent in English and Hindi."
  },
  {
    "url": "https://www.linkedin.com/in/kanchankrishna/",
    "name": "Kanchan Krishna",
    "important": [
      "Computer Science",
      "UIUC",
      "Graduating May 2025",
      "Machine Learning Intern",
      "Capital One",
      "Software Development Engineer Intern",
      "Amazon",
      "Uber",
      "IBM",
      "Python",
      "Django",
      "Data Science Certificate",
      "Dean's List Academic Award"
    ],
    "all_details": "Kanchan Krishna, Computer Science major at UIUC, graduating May 2025. Currently a Machine Learning Intern at Capital One. Previous experience includes Software Development Engineer Intern at Amazon, focusing on Traffic Engineering and AWS systems. Also interned at Uber. Developed homework question bank as a Computer Science Instructor at Juni Learning. Active in Disruption Lab UIUC as Technical Lead, leading a team of 6 in building an interactive virtual classroom. Vice President of Product Space UIUC. Holds a Data Science Certificate from UIUC. Recognized on Dean's List for academic excellence. Skills include Python and Django. Engaged in projects like Syllabus Reader and Application Feature for Quizlet. Volunteered as Python Lead Facilitator for Girls Who Code. Interests in IBM and Oracle."
  },
  {
    "url": "https://www.linkedin.com/in/lathika-potnuru/",
    "name": "Lathika Potnuru",
    "important": [
      "Computer Science Student",
      "UIUC Grainger College of Engineering",
      "Hoeft Technology & Management",
      "Software Engineering Intern at Forcepoint Federal",
      "App Developer for Illinois Solar Decathlon",
      "Project Development for Social Entrepreneurship",
      "Technology Committee Member",
      "National Honors Society Member",
      "Tutoring Experience",
      "Spanish (Limited working proficiency)"
    ],
    "all_details": "Undergraduate student at UIUC Grainger College of Engineering, passionate about intersection of business and computer science. Experience includes Software Engineering Intern at Forcepoint Federal, developing localized ChatGpt, and App Developer for Illinois Solar Decathlon, focusing on energy tracking app. Active in Illinois Enactus for social entrepreneurship projects. Member of National Organization for Business and Engineering, involved in technology committee. Strong skills in Visual Design, IT Project Management, and Feature Prioritization. Education includes Bachelor's in Computer Science from UIUC, with coursework in Object-Oriented Programming and Discrete Mathematics. Volunteering as a tutor, helping students in math. Interests in technology, entrepreneurship, and community service."
  },
  {
    "url": "https://www.linkedin.com/in/sanika-sandeep/",
    "name": "Sanika Sandeep",
    "important": [
      "Undergraduate Research Assistant",
      "Software Engineer Intern",
      "Data Analyst",
      "Quantitative Research Intern",
      "University of Illinois Urbana-Champaign",
      "Girls Who Code",
      "Dean's List Spring 2024",
      "Ralph O. Simmons Undergraduate Research Scholarship",
      "Introduction to Machine Learning",
      "Python Essential Training",
      "Java",
      "Object-Oriented Programming",
      "React.js",
      "Flask",
      "Langchain",
      "NLP",
      "Data Automation"
    ],
    "all_details": "Sanika Sandeep, an undergraduate at University of Illinois Urbana-Champaign, majoring in Computational Physics (2022-2026). Currently an Undergraduate Research Assistant and Software Engineer Intern at MyEdMaster LLC, focusing on AI-powered chatbot development using Flask and Langchain. Experience as Software Engineering Fellow at Headstarter AI, deploying multiple AI projects. Active in Girls Who Code, mentoring young girls in algorithmic thinking. Achievements include Dean's List Spring 2024 and Ralph O. Simmons Undergraduate Research Scholarship. Skills in Python, Java, React.js, and data automation. Certifications in Machine Learning and Python. Interests in AI, data analysis, and educational technology."
  },
  {
    "url": "https://www.linkedin.com/in/parishaa-jindal/",
    "name": "Parishaa Jindal",
    "important": [
      "Student at BBPS",
      "AI & ML",
      "Python",
      "JavaScript",
      "HTML",
      "p5.js",
      "AIR 52 ICAI Commerce Olympiad 2024-25",
      "Pianist",
      "14 y/o",
      "Music and Sports enthusiast",
      "Volunteering",
      "Digital Marketing",
      "Artificial Intelligence",
      "Machine Learning"
    ],
    "all_details": "Student at Bal Bharati Public School (BBPS), focused on AI & ML, proficient in Python, JavaScript, HTML, and p5.js. Achieved AIR 52 in ICAI Commerce Olympiad 2024-25. Engaged in music as a pianist and sports enthusiast. Active volunteer at Vanprasth Vardhijan Sewa Sadan, contributing to social services. Holds a certification in Digital Marketing from Google, valid until Jan 2025. Demonstrated proficiency in Mathematics, Science, and English with top scores. Interested in economic empowerment, education, human rights, and poverty alleviation. Fluent in English and has limited proficiency in French. Engaged in various extracurricular activities, showcasing leadership and collaboration skills."
  },
  {
    "url": "https://www.linkedin.com/in/thenilaymodi/",
    "name": "Nilay Modi",
    "important": [
      "Founder at Central",
      "YC S24",
      "Payroll & government compliance for startups",
      "UCLA",
      "Cognitive Science",
      "Tax Compliance",
      "Design",
      "Marketing",
      "Sales"
    ],
    "all_details": "Founder at Central, a startup focused on payroll and government compliance for startups. Previously co-founded Clayboard (YC W20), a virtual workshop platform. Strong background in tax compliance, marketing, and design. Education includes a Bachelor's in Cognitive Science from UCLA. Active in the startup ecosystem with over 5,600 followers and 500+ connections. Notable for paying over $20,000 in government fines, which inspired the creation of Central. Engaged in various activities related to startup operations and compliance. Holds certifications in deep learning and neural networks from Coursera. Interests include technology and startup development."
  },
  {
    "url": "https://www.linkedin.com/in/mishagandhi/",
    "name": "Misha Gandhi",
    "important": [
      "Executive Director @ EntreCORPS",
      "Incoming Advisory C&O at KPMG US",
      "UI/UX Project Manager",
      "James Scholar",
      "Bachelor of Science in Information Science",
      "University of Illinois Urbana-Champaign",
      "500+ connections"
    ],
    "all_details": "Misha Gandhi, pursuing a Bachelor's in Information Science with a focus on Human-Computer Interaction and User Experience at UIUC. Executive Director at EntreCORPS, leading initiatives in consulting for startups. Incoming Advisory Customer & Operations Intern at KPMG US, with experience in project management and user experience design. Active in various organizations, including Product Management at Illinois. Recognized as a James Scholar, part of the top 10% of iSchool students. Previous roles include Programming Concierge and Business Development Intern. Volunteered for health initiatives and civil rights, raising significant funds for local charities. Holds certifications in Data Storytelling and Generative AI. Fluent in English and Gujarati."
  },
  {
    "url": "https://www.linkedin.com/in/jaydenkimm/",
    "name": "Jayden Kim",
    "important": [
      "Computer Engineer",
      "UIUC",
      "Navy Intern",
      "Consultant at CUBE Consulting",
      "Software Engineer Intern",
      "Python",
      "C++",
      "Problem Solving Certificate",
      "Bergen Leo Club",
      "KIFA All Stars Soccer Team"
    ],
    "all_details": "Junior at UIUC studying Computer Engineering. Experience as Consultant at CUBE Consulting, focusing on Arduino projects for battery health monitoring. Previous Software Engineer Intern at Naval Air Warfare Center, developed equipment database for Presidential Helicopter. Also interned at Beneil Group, utilizing Python for client needs. Active in student organizations, Vice President of Bergen Leo Club, involved in community service. Published research on electronic waste management. Skills include C++, Python, consulting, and problem-solving. Interests in sports, video games, and technology."
  },
  {
    "url": "https://www.linkedin.com/in/prajvaldesignsmachines/",
    "name": "Prajval Arora",
    "important": [
      "Creating FAITH Creator Labs",
      "Researcher",
      "Robotics",
      "Web Development",
      "Artificial Intelligence (AI)",
      "Marketing",
      "Tinker India Labs",
      "Harvard Ventures Tech Summer Programme"
    ],
    "all_details": "Aspiring polymath from Kanpur, Uttar Pradesh, India. Currently involved in creating FAITH Creator Labs, focusing on designing machines and weaving the web. Experience as a Research and Development Intern at Tinker India Labs, working on projects related to robotics and 3D printing. Founder of FAITH Creator Labs since March 2023. Education at Dr. Virendra Swarup Education Center, pursuing 10+2 in Science with Maths. Skills include English as a Second Language, Communication, and various technical skills in robotics and AI. Active in multiple groups related to AI and robotics. Notable achievement: selected for the 2025 Harvard Ventures-TECH Summer Program, showcasing impressive potential in tech innovation."
  },
  {
    "url": "https://www.linkedin.com/in/aryanpatel142006/",
    "name": "Aryan Patel",
    "important": [
      "Freshman",
      "Rutgers University",
      "Honors College",
      "Python Developer",
      "Software Engineering Fellow",
      "Django",
      "Leadership Initiatives",
      "Pramerica Emerging Visionaries",
      "Youngest Nominee The Volunteer Awards 2023"
    ],
    "all_details": "Freshman at Rutgers University, pursuing a degree in Computer Science. Currently a Software Engineering Fellow at Blueprint, focusing on advanced frontend engineering skills and React framework. Previous experience includes Python Developer internship at CodeAlpha and International Business & Development Intern at Leadership Initiatives. Active in leadership roles as Head Boy and Cultural Head Prefect at Bharatiya Vidya Bhavan's. Recognized for volunteering efforts, nominated for The Volunteer Awards 2023, and awarded Silver in Pramerica Emerging Visionaries. Skills include software development, engineering, coding, leadership, and analytical skills. Fluent in English and Gujarati. Interests in technology and community service."
  },
  {
    "url": "https://www.linkedin.com/in/emily-yang-jl9564/",
    "name": "Emily Yang",
    "important": [
      "Student at New York University",
      "IBM Z Student Ambassador",
      "Frontend UI Intern at Octavate",
      "Research Assistant at ViTAL Lab",
      "Cybersecurity Club",
      "Chinese Students and Scholars Association",
      "Dean's Honors List",
      "Python",
      "Java",
      "HTML",
      "CSS",
      "Three.js",
      "Microsoft Azure"
    ],
    "all_details": "Emily Yang, a Computer Science student at New York University (2022-2026), actively involved in various clubs including Cybersecurity Club and Chinese Students and Scholars Association. Currently an IBM Z Student Ambassador and Frontend UI Intern at Octavate. Previous experience as a Research Assistant at ViTAL Lab. Notable skills in Python, Java, HTML, CSS, and Three.js. Recognized on the Dean's Honors List. Engaged in projects like 3D Tic Tac Toe game development. Fluent in Chinese and English. Interests include technology and AI."
  },
  {
    "url": "https://www.linkedin.com/in/ruchadeo/",
    "name": "Rucha Deo",
    "important": [
      "EECS @ UC Berkeley",
      "Regents' and Chancellor's Scholar",
      "AWS",
      "Technical Project Lead",
      "Software Development Engineer Intern",
      "Software Developer",
      "Cloud Computing Researcher",
      "Dynamic Visualizations of EEG Data",
      "Generative AI",
      "Python",
      "Machine Learning"
    ],
    "all_details": "Student at UC Berkeley, pursuing a Bachelor of Science in Electrical Engineering & Computer Science (EECS) from 2022-2026. Experience includes roles as Technical Project Lead at Neurotech@Berkeley, Software Development Engineer Intern at AWS, and Software Developer at AWEAR Technologies. Involved in projects like Dynamic Visualizations of EEG Data and Project CLIP. Skills in Python, Machine Learning, and full-stack development. Active in organizations such as Regents' and Chancellor's Scholars Association and Neurotech@Berkeley. Honors include AP Scholar with Distinction and UC Berkeley Regents' and Chancellor's Scholarship. Interests in technology solutions, interdisciplinary skills in leadership and engineering."
  },
  {
    "url": "https://www.linkedin.com/in/ritesh17rb/",
    "name": "Ritesh Kumar",
    "important": [
      "SDE Intern",
      "Planful",
      "NIT JSR",
      "CSE' 25",
      "Machine Learning",
      "Web Development",
      "QuNITe",
      "Meta Hacker Cup 2024",
      "Ranked 2319 out of 22495"
    ],
    "all_details": "Ritesh Kumar, SDE Intern at Planful, pursuing B.Tech in Computer Science from National Institute of Technology Jamshedpur, expected graduation in 2025. Active member of QuNITe since May 2021. Experience includes internship at Planful starting January 2025. Participated in Meta Hacker Cup 2024, ranked 2319 out of 22495. Interests in problem solving, web development, and machine learning. Engaged in various activities and projects, showcasing skills in Next.js. Strong interpersonal skills, teamwork, and a passion for tackling real-world problems. 4,086 followers, over 500 connections, actively sharing insights and achievements on LinkedIn."
  },
  {
    "url": "https://www.linkedin.com/in/vatsal-shah0914/",
    "name": "Vatsal Shah",
    "important": [
      "Honors CS @ University of Michigan",
      "Product Lead @ TwinMind",
      "Founding Member",
      "Advisor",
      "Campus Strategist @ Perplexity AI",
      "Software Developer @ Michigan Aeronautical Science Association",
      "Data Science Team",
      "IB Diploma",
      "Raffles World Academy",
      "Citizenship Award",
      "Breakthrough Junior Challenge 2023",
      "IELTS 8.5",
      "SAT 1530"
    ],
    "all_details": "Vatsal Shah, an Honors student at University of Michigan, pursuing Computer Science and Business. Experience as Founding Member and Product Lead at TwinMind, focusing on user-centric product development. Advisor role and Campus Strategist at Perplexity AI. Software Developer at Michigan Aeronautical Science Association. Engaged in data science projects, including stock prediction models and sentiment analysis. Active in environmental initiatives, leading paper collection drives. Education includes IB Diploma from Raffles World Academy, with strong performance in mathematics and sciences. Recognized with Citizenship Award for contributions to school community. Participated in Breakthrough Junior Challenge, creating STEM-related content. Proficient in Natural Language Processing and Fourier Analysis. Interests in economic empowerment, education, and technology."
  },
  {
    "url": "https://www.linkedin.com/in/arindam-saha-6b12b91ab/",
    "name": "Arindam Saha",
    "important": [
      "Building @ Stealth",
      "Materials Science Engineering",
      "EECS",
      "University of California, Berkeley",
      "Undergraduate Researcher",
      "Software Developer",
      "Software Engineer Intern @ Microsoft",
      "Bangladesh Angels",
      "Volunteer @ BHALO Inc",
      "Young Champion @ UNICEF",
      "Machine Learning"
    ],
    "all_details": "Arindam Saha, undergraduate at UC Berkeley, pursuing dual major in Electrical Engineering and Computer Science & Materials Science. Experience includes roles as Undergraduate Researcher at Berkeley AI Research, Software Developer for Save the Children in Bangladesh, and Software Engineer Intern at Microsoft. Active in Bangladesh Angels as Affiliate Member. Volunteering with BHALO Inc and UNICEF. Education includes Advanced Regents Diploma from Archbishop Molloy High School. Achievements: 3rd place at Terra NYC STEM Fair in Physics and Astronomy, Top 8 Regionals in Math League. Interests in machine learning, technology, and social impact. Proficient in English and Bengali."
  },
  {
    "url": "https://www.linkedin.com/in/vrcprl/",
    "name": "Veronica Prilutskaya",
    "important": [
      "Co-Founder @ Lingo.dev",
      "Chief Product Officer @ Lingo.dev",
      "YC F24",
      "AI localization for dev teams",
      "Data Science",
      "Notionlytics",
      "Software Engineer",
      "Lead Data Scientist",
      "Senior Data Scientist",
      "Belarusian State University",
      "Public Speaking",
      "Go-to-Market Strategy"
    ],
    "all_details": "Veronica Prilutskaya, Co-Founder and Chief Product Officer at Lingo.dev, specializes in AI localization for development teams. Based in San Francisco, she has a strong background in data science and software engineering. Previously co-founded Notionlytics, a platform for analytics in Notion, and worked as a Lead Data Scientist for major retailers. Holds a Master's in Mathematics and Computer Science from Belarusian State University. Active in Y Combinator's F24 program, she has raised $4.2M in seed funding. Recognized for her contributions in AI and data science, she has experience in product development and customer engagement. Fluent in Belarusian and English, she is passionate about leveraging AI to enhance product localization and user experience."
  },
  {
    "url": "https://www.linkedin.com/in/pratt3000/",
    "name": "Prathamesh Sonawane",
    "important": [
      "Machine Learning Engineer",
      "Doordash",
      "Alexa Prize 2023",
      "University of Illinois Urbana-Champaign",
      "Amazon",
      "Lightbeam.AI",
      "Research Assistant",
      "NLP",
      "Deep Learning",
      "Data Privacy",
      "250K USD Research Grant"
    ],
    "all_details": "Current Machine Learning Engineer at DoorDash since May 2024. Previously worked as a Research Assistant at UIUC and Student Researcher at Amazon. Key contributor to Alexa Social Bot Grand Challenge, awarded 250K USD grant. Holds a Master's in Computer Science from UIUC with a perfect GPA. Bachelor's in Computer Engineering from Pune Institute of Computer Technology. Experience in deep learning, NLP, and data privacy automation. Actively involved in projects like DANOi for online interview integrity. Volunteered with PICT ACM Student Chapter, organizing tech events. Recognized for excellence in competitions, ranked top 1% in Rock-Paper-Scissors challenge. Proficient in English and Hindi, with interests in AI and machine learning advancements."
  },
  {
    "url": "https://www.linkedin.com/in/vidyootsenthil/",
    "name": "Vidyoot Senthil Venkatesh",
    "important": [
      "Software Engineer",
      "Trieve AI",
      "YC W24",
      "Caterpillar Inc.",
      "Georgia Tech",
      "Research Assistant",
      "Python",
      "SQL",
      "C++"
    ],
    "all_details": "Current Software Engineer at Trieve AI, part of Y Combinator W24. Previous experience as Software Engineer at Caterpillar Inc. Education at Georgia Institute of Technology, pursuing Bachelor's in Computer Science (2024-2027). Research Assistant roles at University of Chicago and University of Illinois Urbana-Champaign, focusing on Python and C++. Skills include Python, SQL, C++, and problem-solving. Active in product development, recently launched a product on Product Hunt. Engaged in research and industry experience, looking for opportunities in product data space. Strong network with 500+ connections, interested in technology and innovation."
  },
  {
    "url": "https://www.linkedin.com/in/amit-ranjan-jha/",
    "name": "Amit Ranjan Jha",
    "important": [
      "Software Developer",
      "IBM Labs",
      "TCS Digital",
      "DevSecOps",
      "Python",
      "C++",
      "Post Quantum Cryptography",
      "System Design",
      "OpenShift",
      "Kubernetes",
      "CI/CD",
      "Ansible",
      "Cloud Infrastructure"
    ],
    "all_details": "Amit Ranjan Jha, Software Developer at IBM Labs, previously at TCS Digital. Expertise in DevSecOps, Python, C++, and Post Quantum Cryptography. Strong background in system design, cloud infrastructure, and CI/CD processes. Experience with OpenShift, Kubernetes, and automation tools like Ansible. Holds a B.Tech in Electrical Engineering from Maulana Abul Kalam Azad University of Technology with a CGPA of 9.0. Active in community events like GDG Cloud Community Days. Passionate about building innovative products and solving complex problems. Recognized for collaboration and communication skills in team settings. Interests include emerging technologies and continuous learning."
  },
  {
    "url": "https://www.linkedin.com/in/alisha-virani-abb081276/",
    "name": "Alisha Virani",
    "important": [
      "CS @ UIUC",
      "Sophomore",
      "Python",
      "Java",
      "C++",
      "Spanish-speaking",
      "HTML",
      "Women in Computer Science",
      "Pool Attendant",
      "McHenry County College",
      "3.9 GPA",
      "High honors student achievement",
      "Interested in product management and software engineering"
    ],
    "all_details": "Sophomore Computer Science student at University of Illinois Urbana-Champaign. Experience as Pool Attendant, developing communication and organizational skills. Active in Women in Computer Science, focusing on creating inclusive community. Strong skills in Python, Java, C++, HTML, and data structures. Education includes Associate of Arts from McHenry County College with a 3.9 GPA. Interests in product management and software engineering. Following companies like Microsoft and Google. Engaged in community activities, looking to expand professional network."
  },
  {
    "url": "https://www.linkedin.com/in/celina-anwar/",
    "name": "Celina Anwar",
    "important": [
      "CS @ UIUC",
      "Prev SDE @ Brunswick",
      "Machine Learning Researcher",
      "Product Management Fellow",
      "1st Place at HackIllinois 2024",
      "1st Place at Code Ada Hackathon",
      "Illinois Consulting Academy",
      "Entrepreneurial mindset",
      "Artificial Intelligence",
      "Fintech",
      "Software Engineering",
      "Tech Consulting"
    ],
    "all_details": "Celina Anwar, Computer Science student at University of Illinois Urbana-Champaign. Previous Software Development Engineer at Brunswick. Currently a Machine Learning Researcher and CS124 Honors Project Manager. Engaged in Illinois Consulting Academy and Product Space, Inc. Interests include AI, fintech, software engineering, and tech consulting. Achievements: 1st place at HackIllinois 2024 for HarvestHero project, addressing fertilizer overuse; 1st place at Code Ada Hackathon for ASL learning project. Active in various projects and hackathons, showcasing strong technical skills and leadership. Contact via email for networking."
  },
  {
    "url": "https://www.linkedin.com/in/rugvedb/",
    "name": "Rugved Bongirwar",
    "important": [
      "Finance Student",
      "Gies College of Business",
      "Logistics Planner",
      "Disruption Lab",
      "Business Analyst",
      "Venture Capital Association",
      "Technology Entrepreneur Center",
      "Microsoft Excel",
      "Python",
      "Data Analysis",
      "Business Consulting",
      "Entrepreneurship"
    ],
    "all_details": "Finance Student at Gies College of Business, passionate about business consulting, technology, and entrepreneurship. Currently holds positions as Logistics Planner at Disruption Lab and Business Analyst at Venture Capital Association. Interning at Technology Entrepreneur Center. Skills include Microsoft Excel, Python, data analysis, and business analysis. Education includes a Bachelor of Science in Finance and Data Science, expected graduation in 2028. Previous roles include Project Coordinator at Metrocity Group. Interests in resource management and logistics management. Engaged in networking with 303 connections."
  },
  {
    "url": "https://www.linkedin.com/in/kuangandrew/",
    "name": "Andrew Kuang",
    "important": [
      "Incoming Software Engineering Intern",
      "Palantir Technologies",
      "Data Science @ UC Davis",
      "Software Engineer @ AggieWorks",
      "Internships at Qualcomm, Wahdy Capital, Kubiya.ai",
      "1st Place in Computer Science Category",
      "$2,000 AFCEA STEM Research Grand Scholarship",
      "Python, Kubernetes, Financial Modeling, Linux, React.js"
    ],
    "all_details": "Andrew Kuang, based in San Diego, CA, is an incoming Software Engineering Intern at Palantir Technologies, starting December 2024. Currently pursuing a Bachelor's degree in Data Science at UC Davis, he has gained practical experience as a Software Engineer at AggieWorks, where he led a successful migration project. His internship experiences include roles at Qualcomm, where he optimized language models, and Wahdy Capital, focusing on cloud computing trends. Andrew has received notable accolades, including 1st Place in the Computer Science category at the Greater San Diego Science and Engineering Fair and a $2,000 STEM Research Grand Scholarship. He is skilled in Python, Kubernetes, and financial modeling, and has completed certifications in React Basics and Project Management. Active in extracurriculars, he is part of the Finance and Investment Club and Aggieworks. Interests include technology and innovation."
  },
  {
    "url": "https://www.linkedin.com/in/kevingalarzagrowth-hacking/",
    "name": "Kevin Galarza Santiváñez",
    "important": [
      "Project Manager",
      "Founder",
      "Developer",
      "eCommerce Omnicanal",
      "TAI LOY S.A.",
      "Platzi",
      "Google Certifier Educator",
      "Scrum Foundation Professional",
      "Digital Transformation",
      "Low Code Applications",
      "Artificial Intelligence",
      "Deep Learning",
      "Machine Learning"
    ],
    "all_details": "Experienced Project Manager and Founder with a focus on eCommerce and digital transformation. Currently working at TAI LOY S.A. since Feb 2022 as an eCommerce Programmer. Previous roles include Project Manager at Capital Brands and IT Project Manager at ALTELIZA. Strong background in managing digital projects, leading innovation processes, and proposing technological solutions. Holds certifications from Google and Scrum Foundation. Passionate about technology, digitalization, and agile methodologies. Active in AI and machine learning communities. Engaged in continuous learning through platforms like Platzi. Fluent in Spanish with professional working proficiency."
  },
  {
    "url": "https://www.linkedin.com/in/arjun-soin-97a568114/",
    "name": "Arjun Soin",
    "important": [
      "Founder @ Clinikally",
      "YC S22",
      "Forbes 30 Under 30",
      "Telehealth",
      "Online Pharmacy",
      "AI in Healthcare",
      "Stanford University",
      "Researcher",
      "Blockchain",
      "Digital Health"
    ],
    "all_details": "Founder of Clinikally, a telehealth and online pharmacy platform, leveraging AI for healthcare solutions. Experience as a researcher at Stanford Center for AI in Medicine and Imaging, focusing on healthcare problems. Previous roles include founding team member at Get Safle, streamlining blockchain user experience. Education includes a Master's in Computer Science from Stanford, with a focus on AI and Human-Computer Interaction. Active in various projects and publications related to medical imaging and AI. Engaged in volunteering as a mentor and coordinator for humanitarian efforts. Notable achievements include being featured in Forbes 30 Under 30 and participating in Y Combinator. Interests in economic empowerment, education, and technology."
  },
  {
    "url": "https://www.linkedin.com/in/abhinav-patel-iit/",
    "name": "Abhinav Patel",
    "important": [
      "Product Management",
      "Data Analysis",
      "Strategy Consulting",
      "Prompt Engineering",
      "IIT BHU",
      "Ayana",
      "Public Policy Discussion",
      "CaseQuesta",
      "2nd Place at Indian Institute of Management"
    ],
    "all_details": "Abhinav Patel, currently a Product & Strategy Intern at Ayana, focuses on AI-powered fashion styling. Previous roles include Senior Advisor at Student Counselling Services, IIT(BHU), and Co-Head of Finance & Resources. He has experience in product management, data analysis, and strategy consulting. Education at IIT BHU, pursuing a B.Tech in Mining Engineering. Notable achievements include a Silver Medal in Public Policy Discussion and a Bronze Medal in CaseQuesta competition. Active in various projects, including predictive modeling for risk management. Volunteered as an Editor for IIT Tech Ambit and a Student Guide. Interests in generative AI and policy making. Strong communication skills, recognized for dependability and strategic thinking."
  },
  {
    "url": "https://www.linkedin.com/in/satyamsingh2003/",
    "name": "Satyam Singh",
    "important": [
      "Software Developer",
      "33x Hackathon Wins",
      "NASA Hackathon winner",
      "University of Regina",
      "UR CIRCLE OF SCHOLAR",
      "President @UofRCybersec Club",
      "GATExAVRO Aerospace",
      "Docker",
      "AWS",
      "TypeScript",
      "Django",
      "React Native"
    ],
    "all_details": "Satyam Singh, a Computer Science major at University of Regina, currently a Software Developer at Offstreet. Achievements include 33 hackathon wins, NASA Hackathon winner, and active in UR CIRCLE OF SCHOLAR. Experience includes Junior Full Stack Developer roles at Offstreet and FCC, with skills in TypeScript, AWS, Django, and React Native. Involved in projects like Global Nest and Kickin' Cuisine. Leadership roles as President of Cybersecurity Club and Lead at Google Developer Student Club. Education includes BSc in Computer Science, expected graduation in 2027. Interests in software development, hackathons, and community building."
  },
  {
    "url": "https://www.linkedin.com/in/arnavwad/",
    "name": "Arnav Adhikari",
    "important": [
      "EECS + Finance",
      "MIT",
      "HackMIT 2024",
      "1st Place Grand Prize Winner",
      "Founder, CEO of Stealth Startup",
      "Stanford AIMI",
      "Harvard Med School",
      "Houston, Texas",
      "JavaScript",
      "Dorm Desk",
      "MIT Entrepreneurship Club",
      "Theta Chi Fraternity"
    ],
    "all_details": "19-year-old EECS student at MIT, focused on AI, startups, VC, PM. Extensive experience in fintech, payments, wealth management, AI analysts. Previous roles at BCM, Rice, Stanford AIMI, Harvard Med School. Active in robotics, healthtech (LLM-aided care), productivity tools. Achievements include HackMIT 2024 1st place, founder of a stealth startup, builder at MIT CSAIL. Education includes Bachelor's in EECS + Finance from MIT (2024-2028) and high school diploma from Carnegie Vanguard (2021-2024). Interests in AI, healthtech, and productivity aids."
  },
  {
    "url": "https://www.linkedin.com/in/tatwamasi-dani-20b212299/",
    "name": "Tatwamasi Dani",
    "important": [
      "IBDP Student",
      "Author",
      "Brand Ambassador",
      "Head Girl",
      "Victorious Kidss Educares",
      "Thapar Entrepreneurs Academy",
      "Learner Profile Achiever Award",
      "English",
      "French"
    ],
    "all_details": "IBDP Student at Victorious Kidss Educares, pursuing Economics HL, Business Management HL, Math Application and Interpretation HL, Language and Literature SL, Environmental Systems and Societies SL, Spanish ab initio SL. Author of 'Journey Through Pages' and 'The Zest of Claire Norman'. Brand Ambassador for Thapar Entrepreneurs Academy since 2022. Head Girl at Victorious Kidss Educares, recognized for leadership and public speaking skills. Engaged in community service and educational initiatives, including leading sessions at local schools. Notable achievements include winning a silver medal in an essay competition and receiving the Learner Profile Achiever Award in May 2023. Interests in Harvard University and the United Nations, showcasing a commitment to global education and leadership."
  },
  {
    "url": "https://www.linkedin.com/in/ankur-boyed/",
    "name": "Ankur Boyed",
    "important": [
      "Co-founder",
      "Boardy.ai",
      "Beavr Labs",
      "MentorGPT",
      "Seeko",
      "Glenforest Secondary School",
      "International Baccalaureate",
      "STEM President",
      "FIRST Robotics Programming Captain",
      "Generative AI",
      "Software Development",
      "Entrepreneurial"
    ],
    "all_details": "19-year-old entrepreneurial software developer. Co-founder at Boardy.ai, focusing on generative AI products. Previous roles include Co-Founder & Lead Engineer at Beavr Labs, where designed AI and SaaS products for 15+ startups. Experience with MentorGPT, a project on productizing LLMs. Frontend Web Developer at Seeko, built AI-powered writing assistant. Education: Glenforest Secondary School, 99.2% average, STEM President, led events with 2500+ attendees, FIRST Robotics Captain. Interests in AI, software development, entrepreneurship. Notable achievements include raising $8M seed round for Boardy backed by Creandum. Passionate about building impactful tech solutions."
  },
  {
    "url": "https://www.linkedin.com/in/andrewdsouza/",
    "name": "Andrew D'Souza",
    "important": [
      "Creator / Mad Scientist @ Boardy",
      "ex-Founder/CEO @ Clearco",
      "Board Member @ Realbotix",
      "Artificial Intelligence (AI)",
      "Cognitive Neuroscience",
      "Human Computer Interaction",
      "University of Waterloo",
      "C100 Board Member",
      "TEDx San Francisco Committee Member"
    ],
    "all_details": "Founder and CEO of Boardy, an AI super connector. Previous roles include ex-CEO of Clearco and board member at Realbotix. Strong background in AI, cognitive neuroscience, and human-computer interaction. Education from University of Waterloo in Systems Design Engineering. Active in community through C100 and TEDx San Francisco. Notable projects include raising $8M for Boardy. Interests in creating connections and enhancing human experiences through technology. Published articles on entrepreneurship and career development. Engaged in causes like animal welfare, education, health, and science & technology."
  },
  {
    "url": "https://www.linkedin.com/in/shreyashkarandikar/",
    "name": "Shreyash Karandikar",
    "important": [
      "3x Hackathon Winner",
      "Full Stack Engineer Intern",
      "US Performance Center",
      "Ex-Amdocs",
      "JavaScript",
      "Python",
      "PostgreSQL",
      "AWS",
      "UNC Charlotte '25",
      "Charlotte Hack Outreach Chair 2023-24"
    ],
    "all_details": "Full Stack Engineer Intern at US Performance Center, seeking full-time Software Engineer role in 2025. 3 years of industry experience, passionate about developing robust software solutions. Previous roles include Software Engineer at Amdocs, Backend Engineer at Linxy, and Mobile Application Developer at Oneops. Key projects: Event Listener for Y Combinator Hackathon, CodeVisor winning project at HackNCState 2024. Education: BE in Computer Science from Vidyalankar Institute of Technology. Active in organizations: Charlotte Hack as Outreach Chair, CESA committee member. Skills: JavaScript, Node.js, Kotlin, React.js. Languages: English, Hindi. Notable achievements: Honorable Mention from Y Combinator, HackNCState 2024 Winner. Interests in technology and software development."
  },
  {
    "url": "https://www.linkedin.com/in/austin-kennedy-836a83253/",
    "name": "Austin Kennedy",
    "important": [
      "Origami Agents",
      "Proof of Concept",
      "Gap at UIUC",
      "Gies College of Business",
      "University of Illinois Urbana-Champaign",
      "Co-Founder",
      "Soma Capital",
      "Consultant",
      "Marketing and Growth",
      "Sales Representative at Blue Raven Solar",
      "8.5M views",
      "sponsorships with Rebull, Celsius",
      "1.5M Views"
    ],
    "all_details": "Austin Kennedy, based in the Greater Chicago Area, is a Co-Founder at Origami Agents (YC F24), focusing on finding prospects that convert. Previously served as Proof of Concept, showcasing entrepreneurial skills through content creation, achieving 8.5M views. Currently involved with Soma Capital as a Scout, investing in pre-seed/seed startups. Experience includes consulting roles and marketing strategies, notably with Illini Run Club, securing sponsorships with brands like Rebull and Celsius, generating 1.5M views. Education at Gies College of Business, UIUC. Active on LinkedIn with 4,239 followers, emphasizing strategic use of technology and sales skills."
  },
  {
    "url": "https://www.linkedin.com/in/samirwalji/",
    "name": "Samir Walji",
    "important": [
      "Co-founder @ Sups",
      "Rice University",
      "AI in college admissions",
      "Values and Ventures Competition Winner",
      "SAT: 1580",
      "President of Rice South Asian Society",
      "Full-Stack Development",
      "Large Language Models (LLM)",
      "Quant Trading @ RBC Capital Markets",
      "Venture Analyst @ Techstars"
    ],
    "all_details": "Co-founder and CEO of Sups, focusing on ethical AI for college admissions, acquired by US News. Experience in quant trading and venture analysis. Education at Rice University, pursuing Computer Science, involved in various clubs and leadership roles. Notable achievements include winning a $40k grant and leading a cultural event with over 1,000 participants. Skills in LLMs and full-stack development, with endorsements. Internships at RBC Capital Markets and Techstars, building AI products. Active in sports and community service, with a strong academic background reflected in SAT scores."
  },
  {
    "url": "https://www.linkedin.com/in/larsonbrett/",
    "name": "Brett Larson",
    "important": [
      "Chief People Officer",
      "Expedite Commerce",
      "Frisco, Texas",
      "Human Resources",
      "Technology Leadership",
      "Strategic Planning",
      "Global Organizational Development",
      "Performance Management",
      "Financial Planning",
      "Vice President Operations",
      "Vice President Organizational Development",
      "Director, Human Resources",
      "Graduate of Leadership Frisco",
      "Presidents Award for Community Service"
    ],
    "all_details": "Brett Larson, Chief People Officer at Expedite Commerce, based in Frisco, Texas. Over 20 years of experience in Human Resources and Organizational Development. Key roles include Vice President Operations and Vice President Organizational Development at Trintech. Expertise in strategic planning, technology leadership, and performance management. Holds an MBA from Naveen Jindal School of Management and a BBA from St. Edward's University. Active in community service as a board member for Melody of Hope and program manager for Frisco YEA! Young Entrepreneurs Academy. Recognized for leadership and community contributions, with a focus on employee engagement and organizational culture."
  },
  {
    "url": "https://www.linkedin.com/in/r1chard-li/",
    "name": "Richard Li",
    "important": [
      "Philosophy & Mathematics",
      "Columbia University",
      "Jane Street",
      "Decibel Partners",
      "Pillar",
      "Columbia Organization of Rising Entrepreneurs",
      "AI/ML Application",
      "Cybersecurity",
      "Data Infrastructure",
      "Dev Platform"
    ],
    "all_details": "Richard Li, currently studying Philosophy and Mathematics at Columbia University. Incoming Strategy & Product Summer Intern at Jane Street. Experience as Venture Capital Intern at Decibel Partners focusing on AI/ML applications and cybersecurity. Active in Columbia Organization of Rising Entrepreneurs, serving on the Executive Board. Involved in growth initiatives at Pillar, working on automated risk hedging for MSMEs. Education includes a Bachelor of Arts in Philosophy and Mathematics from Columbia College, expected graduation in 2026. Engaged in various activities, including leading Demo Day and organizing events for startups. Interests in markets, manufacturing, and non-profit sectors. Strong network with 500+ connections."
  },
  {
    "url": "https://www.linkedin.com/in/muzammil67/",
    "name": "Syed Muzammil Ali",
    "important": [
      "Software Developer",
      "Chaos Corporation",
      "AppRays",
      "Bahria University",
      "Mobile Application Development",
      "Flutter",
      "Python",
      "FastAPI",
      "AWS EC2",
      "Docker",
      "Generative AI",
      "Blockchain Basics"
    ],
    "all_details": "Software Developer at Chaos Corporation since Mar 2023, previously at AppRays for 1.5 years. Proficient in Python, FastAPI, AWS EC2, Docker, Flutter, Firebase, API integration. Developed web dashboard for AppRays mobile product with 50k+ downloads. Experience in mobile application development, backend, and generative AI. Education: Master's in Computer Science from Bahria University (expected Aug 2024), Bachelor's from MAJU (3.01 CGPA). Volunteered at Dar ul Sukun, member of Circuit Engineering Society. Skills include Flutter, API integration, mobile app development. Certifications in Blockchain Basics, Backend. Interests in technology and social services."
  },
  {
    "url": "https://www.linkedin.com/in/oliverbraly/",
    "name": "Oliver Wendell-Braly",
    "important": [
      "CEO",
      "fixa",
      "YC F24",
      "San Francisco Bay Area",
      "Product Engineer",
      "Software Engineer",
      "University of Southern California",
      "Solidity",
      "Y Combinator"
    ],
    "all_details": "CEO at fixa, co-founder, Y Combinator F24. Experience in product engineering at Play, software engineering at Scale AI, analytics at ZS. Strong background in building tech solutions, focus on helping people. Education includes Bachelor's from University of Southern California and Y Combinator. Skills in Solidity programming, endorsed by peers. Active on LinkedIn with significant follower engagement. Interests in technology, startups, and innovation."
  },
  {
    "url": "https://www.linkedin.com/in/yirufang/",
    "name": "Yiru Fang",
    "important": [
      "Undergraduate student",
      "University of Minnesota",
      "Data Analyst at USRA",
      "Research Assistant",
      "Machine Learning",
      "Statistics",
      "MATLAB",
      "Microsoft SQL Server",
      "Python",
      "B.S. in Statistics",
      "B.A. in Mathematics",
      "Master's in Statistics at University of Illinois Urbana-Champaign"
    ],
    "all_details": "Undergraduate student at University of Minnesota, pursuing B.S. in Statistics and B.A. in Mathematics. Data Analyst intern at USRA, leveraging skills in Python, MATLAB, and Microsoft SQL Server. Research experience includes roles at University of Minnesota and Rutgers University, focusing on data analysis techniques, machine learning robustness, and algorithm development. Involved in projects applying deep learning for health data analysis and natural language processing. Currently preparing for Master's in Statistics at University of Illinois Urbana-Champaign. Proficient in Python, MATLAB, and SQL. Fluent in Chinese and English. Interests include data science, machine learning, and statistical analysis."
  },
  {
    "url": "https://www.linkedin.com/in/anthea-zhao/",
    "name": "Anthea (Qinyi) Zhao",
    "important": [
      "Data Science",
      "Human Computer Interaction",
      "University of Washington",
      "Fudan University",
      "Founding Engineer",
      "Research Intern",
      "AI agents",
      "User Experience (UX)",
      "Machine Learning",
      "Productivity"
    ],
    "all_details": "Currently a Founding Engineer at a stealth AI startup, previously held research internships at Fudan University and The Hong Kong University of Science and Technology. Expertise in product design and development, with a focus on AI agents and human-AI interaction. Holds a Master's degree in Human Centered Design and Engineering from the University of Washington and a Bachelor's in Data Science from Fudan University. Published work on mobile UI layout generation using large language models. Open to roles as a Design Engineer and Product Manager. Skills include SQL, data science, user research, usability testing, and generative AI. Interests in interdisciplinary collaboration and productivity enhancement through technology."
  },
  {
    "url": "https://www.linkedin.com/in/maljabary/",
    "name": "Mahmoud Aljabary",
    "important": [
      "Founder & CEO",
      "m06",
      "MSc in Data Science",
      "University of Twente",
      "Data Catalog Management",
      "Artificial Intelligence",
      "Machine Learning",
      "Data Science",
      "Robotics",
      "Team Leadership",
      "Entrepreneurship"
    ],
    "all_details": "Founder & CEO at m06 since Nov 2014, extensive experience in data catalog and governance. MSc in Data Science from University of Twente (2017-2021), thesis on web information extraction. Freelance roles in data mesh, data catalog, and data engineering. Strong focus on AI, machine learning, and data accessibility. Endorsed for team leadership and entrepreneurship. Active in mutual groups related to AI and data science. Multilingual: Arabic (native), Dutch (professional). Interests include economic empowerment and technology. Engaged in projects like LE-Game, a web-based entrepreneurship simulation."
  },
  {
    "url": "https://www.linkedin.com/in/nicholas-mcginnis-914641317/",
    "name": "Nicholas McGinnis",
    "important": [
      "User Experience Designer",
      "Founder of Phazur Labs",
      "AI/ML",
      "Engineering",
      "San Antonio Museum of Science and Technology",
      "Academy of Art University",
      "Customer Experience Management",
      "Lean UX",
      "Workshop Instructor",
      "Student Mentor"
    ],
    "all_details": "User Experience Designer & Researcher with a focus on AI/ML and engineering. Founder of Phazur Labs, innovating in UX and productivity applications. Experience includes mentoring at San Antonio Museum of Science and Technology, conducting workshops at UTSA SBDC, and serving on the Board of Advisors for USA Govy Inc. Previous role as User Experience Consultant at Saatchi & Saatchi, enhancing UX for Toyota Financial Services. Education from Academy of Art University in Mobile Applications and iOS Development. Skills in customer experience management, agile methodologies, and lean UX. Active in community engagement and business development."
  },
  {
    "url": "https://www.linkedin.com/in/gauri-gupta-b6973a277/",
    "name": "Gauri Gupta",
    "important": [
      "Student at IIT Kanpur",
      "Junior team member at Team AUV-IITK",
      "Secretary at Media and Cultural Council, IIT Kanpur",
      "Organizer at Antaragni, IIT Kanpur",
      "Skills: AutoCAD, image processing, stereovision, team leadership",
      "Inter IIT Sports Meet 2024"
    ],
    "all_details": "Gauri Gupta, a student at Indian Institute of Technology Kanpur, pursuing a Bachelor's degree in Project Management. Active in various roles including Junior team member at Team AUV-IITK, contributing to projects involving AutoCAD and image processing. Serving as Secretary for Media and Cultural Council and Inter IIT Sports Meet 2024, showcasing leadership and organizational skills. Involved in Antaragni, a cultural festival at IIT Kanpur. Previous experience with astronaut vision in Astrophysics, focusing on leadership and analytical skills. Engaged in activities related to Artificial Intelligence, Deep Learning, and Machine Learning. Strong network with 500+ connections, indicating active participation in professional community."
  },
  {
    "url": "https://www.linkedin.com/in/manali-gaikwad-b817ba236/",
    "name": "Manali Gaikwad",
    "important": [
      "AI Software Engineer",
      "Research Assistant",
      "Saint Louis University",
      "Society of Women Engineers",
      "Dean's List",
      "Computer Science",
      "Deep Learning",
      "Machine Learning",
      "Public Health",
      "Girls Who Code"
    ],
    "all_details": "AI Software Engineer at Saint Louis University, Research Assistant at AIRLab. Specializes in AI, Deep Learning, Computer Vision, Cloud Computing. Experience includes developing AI systems, analyzing data for public health projects. Education: BS in Computer Science, Minor in Robotics, 4.0 GPA. Leadership role as Vice President of Girls Who Code. Attended Society of Women Engineers conference. Skills in AWS, biostatistics, and public health. Active in community service and STEM advocacy. Interests include AI advancements and community resilience."
  },
  {
    "url": "https://www.linkedin.com/in/maiconrcf/",
    "name": "Maicon Ferreira",
    "important": [
      "Founder",
      "GRC",
      "RevOps",
      "Side {Tech} Projects",
      "SafeReport",
      "side.tech",
      "VTEX",
      "Mobile Developer",
      "Harvard Business School",
      "Universidade La Salle",
      "Inclusive Fintech & DeFi Class of 2023"
    ],
    "all_details": "Founder & CEO at SafeReport since Nov 2023, previously Executive Officer at VTEX. Co-founder of side.tech, a product studio. Strong background in GRC and RevOps. Education includes Business Administration from Harvard Business School and Information Technology from Universidade La Salle. Notable achievements include first place in a Hackathon for HTML5 applications for Firefox OS. Active in Mozilla Summit since 2013. Holds a certification in Inclusive Fintech & DeFi from Startupbootcamp. Interests in science and technology, with a focus on building great products and brands. 13,180 followers, over 500 connections."
  },
  {
    "url": "https://www.linkedin.com/in/tania-malhotra02/",
    "name": "Tania Malhotra",
    "important": [
      "Founder",
      "Product Manager",
      "Engineer",
      "Google",
      "ContactOut",
      "Athena VC",
      "Generation Google APAC Scholar",
      "Top Open Source Contributor AOSS",
      "Mentor",
      "Analytical Skills",
      "Project Management"
    ],
    "all_details": "Founder and Product Manager with experience in engineering. Currently an Entrepreneur in Residence at Athena VC. Previous roles include Technical Fellow at Google and Software Engineer at J.P. Morgan. Strong focus on product management and user research. Engaged in mentoring through Pratigya Abhiyan. Recognized as a Generation Google APAC Scholar and Top Open Source Contributor. Active in community discussions, seeking insights from academia. Holds a degree in Computer Science. Passionate about building impactful products and contributing to open source projects. Over 500 connections on LinkedIn, showcasing a robust professional network. Interested in startup culture and user-centric design."
  },
  {
    "url": "https://www.linkedin.com/in/ayushroy9711/",
    "name": "Ayush Roy",
    "important": [
      "Machine Learning",
      "Python Developer",
      "University of Maryland",
      "Minor in Statistics",
      "Hackathon Builder",
      "Software Development",
      "Deep Learning",
      "MLOps",
      "Research Intern",
      "Software Engineer Intern",
      "Artificial Intelligence",
      "Automation in Python"
    ],
    "all_details": "Currently a Machine Learning Intern at Sensable, focusing on multimodal machine learning pipelines. Previous experience includes Software Engineer Intern at Humana and Research Intern at Birlasoft. Strong skills in Python, software development, and machine learning. Education at University of Maryland, pursuing a BS in Computer Science with a minor in Statistics. Active in hackathons, achieving notable placements. Completed certifications in Artificial Intelligence and Automation in Python. Projects include Face Detection and Age Classification, and FraudGuardPro for insurance claims detection. Engaged in AI/ML clubs and various tech-related activities."
  },
  {
    "url": "https://www.linkedin.com/in/wesley-lopes-de-morais-b02844b8/",
    "name": "Wesley Lopes de Morais",
    "important": [
      "Building Disruptive Committees",
      "FACEPE",
      "Agentic Python AI",
      "Open Government",
      "Recife, Pernambuco, Brazil",
      "500+ connections",
      "Machine Learning Community (Moderator)"
    ],
    "all_details": "Wesley Lopes de Morais, currently at FACEPE, focuses on building disruptive committees and promoting open government initiatives. His role involves innovation and internationalization within the organization. Previously, he was a trainee at the Tribunal de Justiça de Pernambuco. He has a background in Science, Technology, and Innovation management from the Universidade de Pernambuco. Active in the Machine Learning Community, Wesley engages with various groups and interests, emphasizing collaboration and transparency in his work. His profile highlights a commitment to fostering innovation and effective governance."
  },
  {
    "url": "https://www.linkedin.com/in/paraggoswami/",
    "name": "Parag Goswami",
    "important": [
      "Co-founder & CEO",
      "Clik.ai",
      "Forbes Real Estate Council",
      "AI tools for CRE investment management",
      "Over 30,000 CRE deals",
      "Financial Modeling",
      "Business Analysis"
    ],
    "all_details": "Experienced leader in commercial real estate technology. Co-founder & CEO of Clik.ai, focusing on AI software for CRE investment management and underwriting. Over 7 years at Clik.ai, enabling banks and asset managers to streamline underwriting processes. Official member of Forbes Real Estate Council since 2020. Previous founder of Integrand Analytics, supporting $7B in CRE/CMBS loan financing. Also founded HouseThat.in, a property listing platform in India. Strong skills in financial modeling and business analysis, endorsed by colleagues. Passionate about automating due diligence tasks and enhancing transaction processes in real estate. Interests include AI applications in finance and real estate technology."
  },
  {
    "url": "https://www.linkedin.com/in/ananya-s-krishnan/",
    "name": "Ananya Krishnan",
    "important": [
      "Incoming @ NVIDIA",
      "Computer Engineering",
      "University of Illinois Urbana-Champaign",
      "Research Assistant",
      "Fellow @ Rewriting the Code",
      "President @ United Under Arts",
      "AP Scholar with Distinction",
      "WSSEF 3rd place in Robotics and Intelligent Machines"
    ],
    "all_details": "Undergraduate student at UIUC pursuing a degree in Computer Engineering. Incoming role at NVIDIA. Research Assistant at Nick Holonyak, Jr. Micro and Nanotechnology Laboratory focusing on semiconductor architectures for AI processing. Fellow at Rewriting the Code, promoting diversity in tech. President of United Under Arts, developing AI-related workshops. Projects include Iclicker Controlled Robot and Electron Ptychography with Bayesian Optimization. Skills in C++, JavaScript, and machine learning. Education includes high school diploma from Tesla STEM High School. Interests in robotics, AI, and cloud computing. Fluent in English, elementary proficiency in Hindi."
  },
  {
    "url": "https://www.linkedin.com/in/abdullahvqr/",
    "name": "Muhammad Abdullah Viqar",
    "important": [
      "Vice President - Photography",
      "Graphics Head @ Paradigm Tech Club",
      "National Level Innovation Champion",
      "Aspiring CS Student",
      "Mayoor School Noida '26",
      "Freelance Photographer",
      "Introduction to Python Certification",
      "AI Project Experience",
      "Leadership",
      "Graphic Design",
      "Event Management"
    ],
    "all_details": "Muhammad Abdullah Viqar, an eleventh-grade student at Mayoor School Noida, passionate about computer science and software engineering. Vice President of Photography in the student council, managing event photography and filmmaking. Graphics Head at Paradigm Tech Club, organizing tech events. Achieved Scholar and Honours badges for academic excellence. Active in Hack Club, focusing on web development. Freelance photographer with over half a million views on Unsplash. Participated in the AtomicAR project, an AR application for visualizing atomic structures. Strong skills in Figma, C#, and leadership. Education includes high school diploma with a 94% AISSE score. Interests in AI, technology, and photography. Languages: English and German."
  },
  {
    "url": "https://www.linkedin.com/in/edwinjosechittilappilly/",
    "name": "Edwin Jose",
    "important": [
      "Generative AI Developer",
      "DataStax",
      "Quantum ML Researcher",
      "PhD Scholar",
      "Western Michigan University",
      "Co-Founder of HAILabs",
      "Innovator in Open Source AI"
    ],
    "all_details": "Generative AI Developer at DataStax, focusing on advanced AI solutions. Quantum ML Researcher with a strong emphasis on machine learning applications in quantum computing. Currently pursuing a PhD at Western Michigan University, contributing to cutting-edge research in AI and quantum technologies. Co-Founder of HAILabs, dedicated to fostering innovation in open-source AI projects. Passionate about leveraging AI for real-world applications, with interests in collaborative research and development. Strong background in software engineering and data analysis, with a commitment to advancing the field of artificial intelligence."
  },
  {
    "url": "https://www.linkedin.com/in/vishesh1301/",
    "name": "Vishesh Anand",
    "important": [
      "Teaching Assistant - Data Structures",
      "Kinetic Vision",
      "Bioinformatics Research",
      "Bearcat Ventures",
      "University of Cincinnati",
      "Software Development",
      "Python",
      "C++",
      "HTML",
      "Bootstrap",
      "Data Engineering",
      "Machine Learning Intern",
      "HackHarvard 2024"
    ],
    "all_details": "Computer Science major at University of Cincinnati. Teaching Assistant for Data Structures, involved in Bioinformatics Development Research. Previous Software Engineering Intern at Kinetic Vision. Analyst at Bearcat Ventures, focusing on startup evaluations. Skills in Python, C++, HTML, Bootstrap, Docker, React.js. Participated in HackHarvard 2024, developed 'Just-Hurry!', a disaster relief platform. Active in CEAS Tribunal as Career Development Chair, organized career fairs. Recognized on Dean's List, involved in University Honors Program. Open to Computer Science Intern and Software Developer roles. Interests in software development, data structures, and collaborative projects."
  },
  {
    "url": "https://www.linkedin.com/in/wouter-gerrits/",
    "name": "Wouter Gerrits",
    "important": [
      "Advisor",
      "Co-Founder",
      "Technical Marketing Automation Specialist",
      "AI",
      "Marketing Automation",
      "Deep Learning",
      "Machine Learning",
      "Cuneo Cashflow",
      "Be Bold Digital",
      "KU Leuven"
    ],
    "all_details": "Wouter Gerrits, based in Antwerp Metropolitan Area, focuses on saving time through AI solutions. Currently an Advisor at First Degree and Co-Founder of Cuneo Cashflow. Previously worked as a Technical Marketing Automation Specialist at Be Bold Digital, integrating AI in marketing. Experience as a Mobile Developer at Hippovibe and Ideal Systems, enhancing management systems and mobile applications. Holds a Master's degree in Intelligent Computing from KU Leuven. Active in AI, marketing automation, and deep learning. Engaged in community groups related to AI and technology. Strong interest in scaling businesses and improving operational efficiency."
  },
  {
    "url": "https://www.linkedin.com/in/ranjana-rajagopalan/",
    "name": "Ranjana Rajagopalan",
    "important": [
      "Computer Science",
      "University of Illinois Urbana-Champaign",
      "AP Scholar with Distinction",
      "2nd place - Synopsys Science Fair",
      "Fremont High School",
      "National Center for Supercomputing Applications",
      "Google"
    ],
    "all_details": "Sophomore at UIUC studying Computer Science. Strong academic background with AP Scholar with Distinction. Achieved 2nd place in Synopsys Science Fair for research on AI interpretability. Completed AP courses in Biology and Calculus BC. Active on LinkedIn with 500+ connections, engaged in community discussions. Interests include supercomputing and technology companies like Google. Based in San Francisco, California. Focused on building a career in tech, exploring opportunities in software development and research."
  },
  {
    "url": "https://www.linkedin.com/in/advait-tahilyani/",
    "name": "Advait Tahilyani",
    "important": [
      "Computer Science Student",
      "University of Illinois Urbana-Champaign",
      "Tech Consulting Intern at EY",
      "Virtual Student Developer at Microsoft",
      "Machine Learning",
      "AI",
      "Web Development",
      "Java",
      "Elasticsearch",
      "TensorFlow"
    ],
    "all_details": "Undergraduate sophomore at UIUC, majoring in Computer Science with a focus on AI, web development, and low-level programming. Experience includes internships at EY and Microsoft, where responsibilities involved data structuring for ML models and developing machine learning applications. Strong academic performance with a GPA of 3.97. Completed high school at The Bombay International School with an International Baccalaureate diploma. Engaged in various courses including Discrete Structures and Intro to Computer Science. Interests in technology and software development, actively building skills in Java, Elasticsearch, and TensorFlow. Currently has 177 connections on LinkedIn, indicating a growing professional network."
  },
  {
    "url": "https://www.linkedin.com/in/arshdpsingh/",
    "name": "Arsh Singh",
    "important": [
      "ML Engineer",
      "Recommender Systems",
      "Language Modeling",
      "IIT Delhi",
      "Observe.AI",
      "ShareChat",
      "Zomato",
      "Microsoft",
      "Deep Learning",
      "Apache Spark",
      "Google BigQuery",
      "Amazon DynamoDB"
    ],
    "all_details": "Arsh Singh, ML Engineer specializing in recommender systems and language modeling. Currently at Observe.AI since 2024. Previously Founding ML Engineer at Ema Unlimited, Senior ML Engineer at ShareChat, and Zomato. Experience in developing backend systems, enhancing user satisfaction through recommendation algorithms. Interned at Microsoft focusing on multilingual transformer models. Holds a graduate teaching assistant position at IIT Delhi, teaching data mining and distributed programming. Publications include works on food delivery networks and vehicle classification. Skills in deep learning, recommender systems, and language modeling. Engaged in real-world problem-solving, with a strong interest in machine learning applications."
  }
]