[
  {
    "url": "https://www.linkedin.com/in/ahmed-aali/",
    "name": "Ahmed Abousuwa",
    "important": [
      "Design Strategist",
      "Senior Design Strategist at Sobeys",
      "RED Academy",
      "Management Consulting",
      "Design Thinking",
      "Strategic Thinking",
      "Analytical Skills",
      "Complex Systems",
      "Human-Centered Systems Thinking",
      "Product-Led Certification"
    ],
    "all_details": "Design strategist focused on innovating businesses to grow and adapt. Based in Greater Toronto Area, Canada. Over 1,100 followers and 500+ connections. Experience includes roles as Senior Design Strategist at Sobeys, UX Designer at Cocomore AG, and User Experience Design Strategist at HAWK:AI. Education from RED Academy in User Experience and User Interface. Key skills: Management Consulting, Design Thinking, Strategic Thinking, Analytical Skills, Complex Systems. Notable achievements include certifications in Human-Centered Systems Thinking and Product-Led strategies. Actively engages in discussions on business strategy and design thinking, emphasizing the importance of discovery in business processes. Interests include arts, culture, education, human rights, and science and technology."
  },
  {
    "url": "https://www.linkedin.com/in/akash-chakor/",
    "name": "Akash (Prasad) Chakor",
    "important": [
      "Founder at Foodkida",
      "ISB'25",
      "Marketing",
      "Food Technology Community",
      "Digital Marketing",
      "Google Ads Certification",
      "Performance Marketing Intern",
      "Social Entrepreneurship"
    ],
    "all_details": "Founder of Foodkida, managing India's largest Food Technology Community for 5 years. Focused on training food industry professionals. Currently pursuing Business at Indian School of Business (ISB) until April 2025. Previous experience includes internships in performance marketing and SEO. Active in community events like Jagriti Yatra. Holds certifications in Google Ads. Engaged in social media marketing and creative design. Interests include Accenture and Deloitte. Strong background in digital marketing and food technology."
  },
  {
    "url": "https://www.linkedin.com/in/ravi-bharihoke-9a92a412/",
    "name": "Ravi Bharihoke",
    "important": [
      "Co-Founder",
      "Enerjazz",
      "YC S21",
      "IIT Kharagpur",
      "Battery Swapping Network",
      "Electric Vehicles",
      "13+ years in energy industry",
      "Shell",
      "Senior Consultant",
      "Founder of SLPS",
      "Mentored by Wouter Robers"
    ],
    "all_details": "IIT Kharagpur graduate, extensive experience in operations, strategy, and analytics across three continents in the energy sector for over 13 years. Co-Founder of Enerjazz, focusing on building battery swapping networks for commercial EVs in India, achieving over 4 million kilometers on the road. Previous roles include Founder at SLPS, Senior Consultant at Shell, and various engineering positions. Active in alumni associations and mentoring. Passionate about clean energy solutions and e-mobility ecosystems. Published work in separation and purification technology. Strong endorsements in energy and project management."
  },
  {
    "url": "https://www.linkedin.com/in/tadeosoto/",
    "name": "Jesus Soto",
    "important": [
      "AMS Talent Acquisition Consultant",
      "HP",
      "Poly",
      "Talent Acquisition Lead, LATAM",
      "Senior Talent Acquisition Partner",
      "Bilingual English-Spanish",
      "16+ years of experience",
      "Information Technology",
      "Computer Software",
      "Electrical/Electronic",
      "Become a Tech Recruiter certification"
    ],
    "all_details": "Experienced Talent Acquisition Consultant at HP, focusing on global talent acquisition in IT. Previously led LATAM recruitment at Poly, with a strong background in sourcing for tech roles. Over 16 years in recruitment, specializing in IT and engineering sectors. Proven track record in building relationships with stakeholders, optimizing recruitment processes, and mentoring junior recruiters. Holds a degree in Information Technology Administration from Universidad del Norte. Actively engaged in community causes, including children's rights and civil rights. Fluent in English and Spanish, enhancing communication in diverse environments. Recognized for contributions to inclusive hiring practices and recruitment marketing."
  },
  {
    "url": "https://www.linkedin.com/in/saswatim3197/",
    "name": "Saswati Mishra",
    "important": [
      "MBA Candidate",
      "Kellogg School of Management",
      "Impact Research",
      "Atlan",
      "Good Business Lab",
      "Research Associate",
      "Senior Research Associate",
      "Program Management",
      "Process Improvement",
      "Northwestern University",
      "Ashoka University",
      "Economics"
    ],
    "all_details": "Purpose-driven professional with diverse background in economic research, strategy, operational excellence. Currently pursuing MBA at Kellogg School of Management, focusing on strategy, finance, sustainability. Experience at Atlan, a data collaboration workspace, enabling teams like Nasdaq, Autodesk. Previous roles include Senior Research Associate at Good Business Lab, working on mental health and migration issues. Research Associate role involved data management for migrant workers. Education includes MBA from Northwestern University, MA in Economics from Ashoka University. Core team member at Enactus Ramjas, building employment capacity for underprivileged women. Skills in program management, process improvement. Interests in tech, impact research, and social entrepreneurship."
  },
  {
    "url": "https://www.linkedin.com/in/ananya-singh-5a57a81b1/",
    "name": "Ananya Singh",
    "important": [
      "Incoming Assistant Manager",
      "IDBI Bank",
      "Summer Intern",
      "Jubilant Consumer Pvt Ltd",
      "IIM Kashipur MBA'25",
      "ARSD, Delhi University",
      "Sales Executive",
      "Channel Sales Development",
      "Marketing Strategy"
    ],
    "all_details": "Experienced Management Professional with strong educational background in Chemistry and Business Administration. Currently pursuing MBA at IIM Kashipur. Previous role as Sales Executive at Medley Online Ventures, focusing on channel sales development. Completed internship at Jubilant Consumer Pvt Ltd, recognized for contributions in marketing strategy. Active in executive committee roles during undergraduate studies at Atma Ram Sanatan Dharma College. Strong interest in AI applications in marketing, demonstrated through posts on LinkedIn. Engaged in networking with over 500 connections, showcasing a proactive approach to career development."
  },
  {
    "url": "https://www.linkedin.com/in/kmanish21/",
    "name": "Manish Kumar",
    "important": [
      "Technical Project Manager",
      "Hilti Group",
      "Indian Institute of Technology, Bombay",
      "Martin Hilti Innovation Prize 2022",
      "R&D Manager",
      "Dual Degree (B.Tech + M.Tech)",
      "Metallurgical Engineering and Materials Science",
      "370 connections",
      "Board Member at India Club in Liechtenstein"
    ],
    "all_details": "Manish Kumar, Technical Project Manager at Hilti Group, focused on new product development and manufacturing. Experience includes R&D Manager and Deputy Manager roles at Hilti Manufacturing India. Holds a dual degree from IIT Bombay in Metallurgical Engineering and Materials Science. Achievements include winning the Martin Hilti Innovation Prize 2022. Active in volunteering as a Board Member for India Club in Liechtenstein, responsible for publicity and events. Previous roles include Undergraduate Teaching Assistant at IIT Bombay. Skills in Microsoft Office and Customer Service. Interests in arts and culture, with a strong background in sports, having captained cricket and Kh-Kho teams at IIT Bombay. Engaged in various extracurricular activities during education, including cricket and Mood Indigo festival."
  },
  {
    "url": "https://www.linkedin.com/in/knara/",
    "name": "Kaushik Narasimhan",
    "important": [
      "Co-Founder",
      "Take2 AI",
      "2 x Stanford Alum",
      "AI-Powered job simulation platform",
      "General Atlantic Global Human Capital Series",
      "Masters Candidate",
      "Stanford University",
      "Business Strategy",
      "Predictive Analytics",
      "Flex",
      "Mu Sigma",
      "Economic Empowerment",
      "Education",
      "Poverty Alleviation"
    ],
    "all_details": "Co-Founder at Take2 AI, focused on AI-driven recruitment solutions. Experience in leading business units at Flex, achieving significant revenue growth. Dual Master's degrees from Stanford University in Business Administration and Public Policy. Active in entrepreneurial initiatives, represented Take2 AI at notable events. Skills in Business Strategy and Predictive Analytics, endorsed by colleagues. Interests include Google and Harvard Business Review. Committed to causes like economic empowerment and education. Over 500 connections, leveraging network for growth and collaboration."
  },
  {
    "url": "https://www.linkedin.com/in/mahmood-mohamed/",
    "name": "Mahmood Mohamed",
    "important": [
      "Manager Business Development Downstream and Trading",
      "Bapco Energies",
      "Sustainability Manager",
      "PwC Luxembourg",
      "Development Manager",
      "NEOM",
      "Visiting Lecturer",
      "Teesside University",
      "Chartered Manager",
      "Chartered Scientist",
      "Invented Concrete with Recyclable Materials",
      "Public Speaking",
      "Engineering Design",
      "Career Development Coaching",
      "Environmental Consulting",
      "Leadership Development",
      "Institution of Civil Engineers",
      "AI",
      "Strategic Planning"
    ],
    "all_details": "Experienced professional in business development and sustainability, currently a Manager at Bapco Energies focusing on energy efficiency and AI initiatives. Former Sustainability Manager at PwC Luxembourg. Development Manager at NEOM, overseeing projects in Saudi Arabia. Visiting Lecturer at Teesside University, sharing knowledge in structural engineering. Holds a PGC in Structural Engineering from The University of Edinburgh and a similar degree from the University of Glasgow. Active in professional organizations, serving as President of Engineers Without Borders UK and a mentor at the Institution of Civil Engineers. Recognized for contributions to sustainable projects, including the invention of concrete using recyclable materials. Fluent in Arabic and English, passionate about making a positive impact on society and the environment."
  }
]